Revit 2027 API
PerformanceAdviser.SetRuleEnabled Method
Overload List
Name | Description
SetRuleEnabled(Int32, Boolean) |  Retrieves an enabled/disabled status for the given rule.
SetRuleEnabled(PerformanceAdviserRuleId, Boolean) |  Retrieves an enabled/disabled status for the given rule.
Top
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace